#Найдите сумму цифр трехзначного числа n.
#Результат сохраните в перменную res.
n=123
n1=n//100
n2=(n//10)%10
n3=n%10
print(n1+n2+n3)